GopalSaraf/Practicals/PSDL/include/proc/pic16lf19195.h
extern volatile RD1PPSbits_t RD1PPSbits __at(0x1F29);
// bitfield macros
#define _RD1PPS_RD1PPS0_POSN                                0x0
#define _RD1PPS_RD1PPS0_POSITION                            0x0
#define _RD1PPS_RD1PPS0_SIZE                                0x1
#define _RD1PPS_RD1PPS0_LENGTH                              0x1
#define _RD1PPS_RD1PPS0_MASK                                0x1
#define _RD1PPS_RD1PPS1_POSN                                0x1
#define _RD1PPS_RD1PPS1_POSITION                            0x1
#define _RD1PPS_RD1PPS1_SIZE                                0x1
#define _RD1PPS_RD1PPS1_LENGTH                              0x1
#define _RD1PPS_RD1PPS1_MASK                                0x2
#define _RD1PPS_RD1PPS2_POSN                                0x2
#define _RD1PPS_RD1PPS2_POSITION                            0x2
#define _RD1PPS_RD1PPS2_SIZE                                0x1
#define _RD1PPS_RD1PPS2_LENGTH                              0x1
#define _RD1PPS_RD1PPS2_MASK                                0x4
#define _RD1PPS_RD1PPS3_POSN                                0x3
#define _RD1PPS_RD1PPS3_POSITION                            0x3
#define _RD1PPS_RD1PPS3_SIZE                                0x1
#define _RD1PPS_RD1PPS3_LENGTH                              0x1
#define _RD1PPS_RD1PPS3_MASK                                0x8
#define _RD1PPS_RD1PPS4_POSN                                0x4
#define _RD1PPS_RD1PPS4_POSITION                            0x4
#define _RD1PPS_RD1PPS4_SIZE                                0x1
#define _RD1PPS_RD1PPS4_LENGTH                              0x1
#define _RD1PPS_RD1PPS4_MASK                                0x10
#define _RD1PPS_RD1PPS5_POSN                                0x5
#define _RD1PPS_RD1PPS5_POSITION                            0x5
#define _RD1PPS_RD1PPS5_SIZE                                0x1
#define _RD1PPS_RD1PPS5_LENGTH                              0x1
#define _RD1PPS_RD1PPS5_MASK                                0x20

// Register: RD2PPS
#define RD2PPS RD2PPS
extern volatile unsigned char           RD2PPS              __at(0x1F2A);
#ifndef _LIB_BUILD
asm("RD2PPS equ 01F2Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RD2PPS0                :1;
        unsigned RD2PPS1                :1;
        unsigned RD2PPS2                :1;
        unsigned RD2PPS3                :1;
        unsigned RD2PPS4                :1;
        unsigned RD2PPS5                :1;
    };
} RD2PPSbits_t;
extern volatile RD2PPSbits_t RD2PPSbits __at(0x1F2A);
// bitfield macros
#define _RD2PPS_RD2PPS0_POSN                                0x0
#define _RD2PPS_RD2PPS0_POSITION                            0x0
#define _RD2PPS_RD2PPS0_SIZE                                0x1
#define _RD2PPS_RD2PPS0_LENGTH                              0x1
#define _RD2PPS_RD2PPS0_MASK                                0x1
#define _RD2PPS_RD2PPS1_POSN                                0x1
#define _RD2PPS_RD2PPS1_POSITION                            0x1
#define _RD2PPS_RD2PPS1_SIZE                                0x1
#define _RD2PPS_RD2PPS1_LENGTH                              0x1
#define _RD2PPS_RD2PPS1_MASK                                0x2
#define _RD2PPS_RD2PPS2_POSN                                0x2
#define _RD2PPS_RD2PPS2_POSITION                            0x2
#define _RD2PPS_RD2PPS2_SIZE                                0x1
#define _RD2PPS_RD2PPS2_LENGTH                              0x1
#define _RD2PPS_RD2PPS2_MASK                                0x4
#define _RD2PPS_RD2PPS3_POSN                                0x3
#define _RD2PPS_RD2PPS3_POSITION                            0x3
#define _RD2PPS_RD2PPS3_SIZE                                0x1
#define _RD2PPS_RD2PPS3_LENGTH                              0x1
#define _RD2PPS_RD2PPS3_MASK                                0x8
#define _RD2PPS_RD2PPS4_POSN                                0x4
#define _RD2PPS_RD2PPS4_POSITION                            0x4
#define _RD2PPS_RD2PPS4_SIZE                                0x1
#define _RD2PPS_RD2PPS4_LENGTH                              0x1
#define _RD2PPS_RD2PPS4_MASK                                0x10
#define _RD2PPS_RD2PPS5_POSN                                0x5
#define _RD2PPS_RD2PPS5_POSITION                            0x5
#define _RD2PPS_RD2PPS5_SIZE                                0x1
#define _RD2PPS_RD2PPS5_LENGTH                              0x1
#define _RD2PPS_RD2PPS5_MASK                                0x20

// Register: RD3PPS
#define RD3PPS RD3PPS
extern volatile unsigned char           RD3PPS              __at(0x1F2B);
#ifndef _LIB_BUILD
asm("RD3PPS equ 01F2Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RD3PPS0                :1;
        unsigned RD3PPS1                :1;
        unsigned RD3PPS2                :1;
        unsigned RD3PPS3                :1;
        unsigned RD3PPS4                :1;
        unsigned RD3PPS5                :1;
    };
} RD3PPSbits_t;
extern volatile RD3PPSbits_t RD3PPSbits __at(0x1F2B);
// bitfield macros
#define _RD3PPS_RD3PPS0_POSN                                0x0
#define _RD3PPS_RD3PPS0_POSITION                            0x0
#define _RD3PPS_RD3PPS0_SIZE                                0x1
#define _RD3PPS_RD3PPS0_LENGTH                              0x1
#define _RD3PPS_RD3PPS0_MASK                                0x1
#define _RD3PPS_RD3PPS1_POSN                                0x1
#define _RD3PPS_RD3PPS1_POSITION                            0x1
#define _RD3PPS_RD3PPS1_SIZE                                0x1
#define _RD3PPS_RD3PPS1_LENGTH                              0x1
#define _RD3PPS_RD3PPS1_MASK                                0x2
#define _RD3PPS_RD3PPS2_POSN                                0x2
#define _RD3PPS_RD3PPS2_POSITION                            0x2
#define _RD3PPS_RD3PPS2_SIZE                                0x1
#define _RD3PPS_RD3PPS2_LENGTH                              0x1
#define _RD3PPS_RD3PPS2_MASK                                0x4
#define _RD3PPS_RD3PPS3_POSN                                0x3
#define _RD3PPS_RD3PPS3_POSITION                            0x3
#define _RD3PPS_RD3PPS3_SIZE                                0x1
#define _RD3PPS_RD3PPS3_LENGTH                              0x1
#define _RD3PPS_RD3PPS3_MASK                                0x8
#define _RD3PPS_RD3PPS4_POSN                                0x4
#define _RD3PPS_RD3PPS4_POSITION                            0x4
#define _RD3PPS_RD3PPS4_SIZE                                0x1
#define _RD3PPS_RD3PPS4_LENGTH                              0x1
#define _RD3PPS_RD3PPS4_MASK                                0x10
#define _RD3PPS_RD3PPS5_POSN                                0x5
#define _RD3PPS_RD3PPS5_POSITION                            0x5
#define _RD3PPS_RD3PPS5_SIZE                                0x1
#define _RD3PPS_RD3PPS5_LENGTH                              0x1
#define _RD3PPS_RD3PPS5_MASK                                0x20

// Register: RD4PPS
#define RD4PPS RD4PPS
extern volatile unsigned char           RD4PPS              __at(0x1F2C);
#ifndef _LIB_BUILD
asm("RD4PPS equ 01F2Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RD4PPS0                :1;
        unsigned RD4PPS1                :1;
        unsigned RD4PPS2                :1;
        unsigned RD4PPS3                :1;
        unsigned RD4PPS4                :1;
        unsigned RD4PPS5                :1;
    };
} RD4PPSbits_t;
